FemDesign.Shells.Panel
panel_type

FemDesign.Shells.Panel._instance
Panel instance counter

FemDesign.Shells.Panel._coordinateSystem
Coordinate system

FemDesign.Shells.Panel._localOrigin
Deinfes the position of the local coordinate system

FemDesign.Shells.Panel._localX
LocalX and direction of panels

FemDesign.Shells.Panel.LocalZ
LocalZ

FemDesign.Shells.Panel._region
Region of panel

FemDesign.Shells.Panel.AnchorPoint
Defines position of base line when using panel type analytical model

FemDesign.Shells.Panel.TimberPanelData
This property describes the material of the panel (if the panel is a timber panel).
The PanelLibraryData referenced in this property can be either Orthotropic, CLT or GLC.

FemDesign.Shells.Panel.OrthotropicPanelLibraryData
This is a placeholder for the PanelLibraryData which is referenced in TimberPanelData

FemDesign.Shells.Panel.CltPanelLibraryData
This is a placeholder for the PanelLibraryData which is referenced in TimberPanelData

FemDesign.Shells.Panel.GlcPanelLibraryData
This is a placeholder for the PanelLibraryData which is referenced in TimberPanelData

FemDesign.Shells.Panel.Thickness
Only for struxml export to Revit and/or Tekla. Not used in calculation.

FemDesign.Shells.Panel.SetExternalEdgeConnections(FemDesign.Shells.EdgeConnection)
Set external edge connections (i.e. set edge connections around region).
When this is performed for panels the external rigidity is changed accordingly.
ec: EdgeConnection

FemDesign.Shells.Panel.SetExternalEdgeConnectionAtIndexForContinousAnalyticalModel(FemDesign.Shells.EdgeConnection,System.Int32)
Set external edge connection at index (i.e. set edge connections at specific edge of region).
ec: EdgeConnection
index: Index of edge to set at region of first (and only) internal panel.

FemDesign.Shells.Panel.SetExternalEdgeConnectionsForContinuousAnalyticalModel(FemDesign.Shells.EdgeConnection,System.Collections.Generic.List{System.Int32})
Set external edge connection at indices (i.e. set edge connections at specific edges of region).
shellEdgeConnection: EdgeConnection.
indices: Index. List of items

FemDesign.Shells.Panel.#ctor
Parameterless constructor for serialization

FemDesign.Shells.Panel.#ctor(FemDesign.Geometry.Region,FemDesign.Geometry.Point3d,FemDesign.InternalPanels,FemDesign.Shells.EdgeConnection,FemDesign.Shells.PanelType,FemDesign.Materials.Material,FemDesign.Sections.Section,System.String,System.String,System.Double,System.Double,FemDesign.Shells.ShellEccentricity,System.Boolean)
Construct standard panel with "Continuous" analytical model.
region: Region of shell containing panels.
localX: Direction of panels.
anchorPoint:
externalRigidity: Default value for shell border EdgeConnections. Can be overwritten by EdgeConnection for each specific edge in Region.
type: Type of panel.
complexMaterial: Guid reference to material.
complexSection: Guid reference to complex section.
identifier: Name of shell.
panelName: Name of panel.
gap: Gap between panels.
orthotropy: Orthotropy.
ecc: ShellEccentricity.
externalMovingLocal: EdgeConnection LCS changes along edge?

FemDesign.Shells.Panel.#ctor(FemDesign.Geometry.Region,FemDesign.Geometry.Point3d,FemDesign.InternalPanels,FemDesign.Materials.TimberPanelType,FemDesign.Shells.EdgeConnection,FemDesign.Shells.PanelType,System.String,System.String,System.Double,System.Double,FemDesign.Shells.ShellEccentricity,System.Boolean,System.Double)
Construct timber panel with "Continuous" analytical model.
region: Region of shell containing panels.
anchorPoint:
internalPanels:
externalEdgeConnection: Default value for shell border EdgeConnections. Can be overwritten by EdgeConnection for each specific edge in Region.
timberApplicationData:
type: Type of panel.
identifier: Name of shell.
panelName: Name of panel.
gap: Gap between panels.
orthotropy: Orthotropy.
ecc: ShellEccentricity.
externalMovingLocal: EdgeConnection LCS changes along edge?

FemDesign.Shells.Panel.DefaultContreteContinuous(FemDesign.Geometry.Region,FemDesign.Shells.EdgeConnection,FemDesign.Materials.Material,FemDesign.Sections.Section,System.String,System.Double,FemDesign.Shells.ShellEccentricity)
Create a default concrete shell with panels using a continuous analytical model.
region: Panel region.
externalEdgeConnection:
material:
section:
identifier: Name of shell.
orthotropy:
ecc:
Returns:

FemDesign.Shells.Panel.DefaultTimberContinuous(FemDesign.Geometry.Region,FemDesign.Materials.TimberPanelType,FemDesign.Geometry.Vector3d,FemDesign.Shells.EdgeConnection,System.String,FemDesign.Shells.ShellEccentricity,System.Double)
Create a default timber shell with panels using a continuous analytical model.
region: Panel region.
timberPlateMaterial: Timber material. See FemDesign.Materials.TimberPanelType.
direction: Timber panel span direction.
externalEdgeConnection:
identifier: Name of shell.
eccentricity:
panelWidth:
Returns: